Update README.md
update system architecture to include mermaid graph
